{
  "layout/header-closeMenu": "Close menu",
  "layout/header-darkThemeMode": "Turn on the light",
  "layout/header-lightThemeMode": "Turn off the light",
  "layout/header-openMenu": "Open menu",
  "layout/header-translate": "Translate",
  "layout/header/navigation-contacts": "Contacts",
  "layout/header/navigation-introduction": "Introduction",
  "layout/header/navigation-skills": "Skills",
  "layout/header/navigation-timeline": "Timeline",
  "pages/root-home": "Home",
  "sections/contacts-email": "EMAIL",
  "sections/contacts-mailSubject": "Hi !",
  "sections/contacts-phone": "PHONE",
  "sections/contacts-resume": "RESUME",
  "sections/contacts/banner-contactMe": "Contact Me",
  "sections/landing-dev": "DEVELOPER",
  "sections/landing-scroll": "SCROLL",
  "sections/landing-swipeUp": "SWIPE UP",
  "sections/landing-webDev": "WEB DEVELOPER",
  "sections/purpose-story": "<story1>I'm a French Software Engineer based in Paris. For more than five years, I have a passion for writing beautiful code and crafting <timeline>robust and functional web products</timeline> using <skills>wonderful technologies</skills>.</story1><story2>As an agile developer my main goal is to deliver the expected products on time and to make my work transparent. You like my work and want to talk to me ? Hit me up on my <email>email</email> or simply <phone>call me</phone> !</story2>",
  "sections/purpose-title": "Hi, I'm Florian, this is my interactive resume",
  "sections/skills-back": "Back-End",
  "sections/skills-front": "Front-End",
  "sections/skills-languages": "Languages",
  "sections/skills-others": "Some Others",
  "sections/skills-story": "<story1>I create <responsive>responsive</responsive> web apps that are performant, <i18n>internationalized</i18n> and optimized for <seo>SEO</seo>. The main area of my expertise is the front-end development,</story1><story2><strong>THANKS TO REACT</strong> it became painless to build efficient user interfaces.</story2><story3>Since I have been able to use most of the modern web technologies while bringing them into production, I can easily adapt to the project stack I am working on.</story3>",
  "sections/skills-tools": "Tools",
  "sections/timeline-closeDrawer": "close",
  "sections/timeline-duration": "Duration",
  "sections/timeline-education": "Education",
  "sections/timeline-employee": "Employee",
  "sections/timeline-europAssistance": "Europ Assistance",
  "sections/timeline-europAssistanceStory": "For <ea>Europ Assistance</ea>, I crafted a complete client-side back-office allowing the administrator to manage users permissions.",
  "sections/timeline-freelance": "Freelance",
  "sections/timeline-monthDuration": "{duration} month",
  "sections/timeline-monthsDuration": "{duration} months",
  "sections/timeline-oecd": "OECD",
  "sections/timeline-oecdStory": "<oecd>The Organization for Economic Co-operation and Development (OECD)</oecd> is an international economic organization. Through an application designed to help the authors of the OECD to publish their books, my mission led me to achieve :<ul><li>An implementation of unit tests including a coverage up to 70%.</li><li>The refactoring of a huge document publication form generating a significant performance gain and a better scalability of the source code.</li><li>The implementation of new features, in particular that of pre-filling the form (files, metadata) according to the profile of the author and the type of the publication.</li></ul>",
  "sections/timeline-redpelicans": "Redpelicans",
  "sections/timeline-redpelicansStory": "<p><redpelicans>Redpelicans</redpelicans> is a company based in Paris who offer a full stack Javascript expertise to their clients.</p><p>The first 3 months of my adventure as an employee were an intensive full stack Javascript training period. Followed by my progressive integration in sophisticated Javascript projects, allowing me to have the opportunity to work with developers who have more than 20 years of experience in the field.</p>",
  "sections/timeline-school": "School 42",
  "sections/timeline-schoolStory": "<p><school>42</school> is <bestSchool>one of the best</bestSchool> engineering and programming college that offers rigorous, industry-leading education in a professional environment. The program is designed to prepare students for the digital world and the technology industry.</p><p>Around <schoolProjects>interesting projects</schoolProjects> 42 allowed me to perfect my <lowLevel>low-level</lowLevel> coding skills and to learn to work within a team.</p>",
  "sections/timeline-selfEducation": "Self Education",
  "sections/timeline-selfEducationStory": "<p>My journey started in 2010 when I discovered coding. I made my first steps in an 'autodidact' way, learning from scratch my firsts programming languages (C, C++, Python). Very quickly, I loved the fact that I could craft useful software as well as automate painful tasks with just lines of code.</p><p>The WEB is starting to interest me in particular. During this period, I built some fun projects such as bots, web scrapers and web apps.</p>",
  "sections/timeline-sisCc": "SIS-CC",
  "sections/timeline-sisCcStory": "The project was to implement an authentication service in the <sis>SIS-CC</sis> architecture, this mission included :<ul><li>The preliminary study of the Keycloak tool, and the delivery of a model of the solution.</li><li>The implementation of the authorization workflow and the React components to manage the private routes.</li><li>The upgrade of the architecture servers to manage authentication.</li><li>The implementation of examples of private back-end services for third party developers.</li></ul>",
  "sections/timeline-techs": "Used technologies",
  "sections/timeline-unicef": "UNICEF",
  "sections/timeline-unicef2": "UNICEF 2",
  "sections/timeline-unicef2Story": "In this mission, I implemented new features on the <childMortality>Childmortality</childMortality>'s interface such as the addition of new series of graphics or the implementation of a mobile oriented responsive on some views.",
  "sections/timeline-unicefStory": "<p>For my first mission with <unicef>UNICEF</unicef> I had to build a rendering server in the form of a WEB service allowing to transform parts of HTML WEB sections into PDF or PNG.</p><p>Which includes the development of a node.js server hosting the page rendering service via Puppeteer and the implementation of a 'show room' allowing the client to demonstrate the use of the service to the UNICEF project managers.</p>",
  "sections/timeline-yearDuration": "{duration} year",
  "sections/timeline-yearsDuration": "{duration} years"
}