{
  "layout/header-closeMenu": "Fermer le menu",
  "layout/header-darkThemeMode": "Allumer la lumière",
  "layout/header-lightThemeMode": "Éteindre la lumière",
  "layout/header-openMenu": "Ouvrir le menu",
  "layout/header-translate": "Traduire",
  "layout/header/navigation-contacts": "Contacts",
  "layout/header/navigation-introduction": "Introduction",
  "layout/header/navigation-skills": "Compétences",
  "layout/header/navigation-timeline": "Chronologie",
  "pages/root-home": "Accueil",
  "sections/contacts-email": "EMAIL",
  "sections/contacts-mailSubject": "Salut !",
  "sections/contacts-phone": "TÉLÉPHONE",
  "sections/contacts-resume": "CURRICULUM VITAE",
  "sections/contacts/banner-contactMe": "Contacts",
  "sections/landing-dev": "DÉVELOPPEUR",
  "sections/landing-scroll": "SCROLL",
  "sections/landing-swipeUp": "SWIPE UP",
  "sections/landing-webDev": "DÉVELOPPEUR WEB",
  "sections/purpose-story": "<story1>Je suis un ingénieur logiciel français basé à Paris. Depuis plus de cinq ans, je prends plaisir à écrire du code de qualité afin de créer des <timeline>applications web robustes et fonctionnelles</timeline> grâce à de <skills>superbes technologies</skills>.</story1><story2>En tant que développeur agile, ma ligne directrice est de livrer les produits de mes clients à temps tout en rendant mon travail transparent. Vous aimez mon travail et vous voulez en savoir plus ? Contactez-moi sur mon <email>mail</email> ou simplement <phone>appelez moi</phone> !</story2>",
  "sections/purpose-title": "Bonjour, voici mon CV interactif",
  "sections/skills-back": "Back-End",
  "sections/skills-front": "Front-End",
  "sections/skills-languages": "Langues",
  "sections/skills-others": "Quelques autres",
  "sections/skills-story": "<story1>Je crée des applications web <responsive>responsive</responsive> performantes, <i18n>internationalisées</i18n> et optimisées pour le <seo>SEO</seo>. Le principal domaine de mon expertise est le développement front-end,</story1><story2><strong>Grâce à REACT</strong> il est devenu facile de construire des interfaces utilisateurs efficaces.</story2><story3>Comme j'ai pu utiliser la plupart des technologies web modernes tout en les mettant en production, je peux facilement m'adapter à la stack du projet sur lequel je travaille.</story3>",
  "sections/skills-tools": "Outils",
  "sections/timeline-closeDrawer": "Fermer",
  "sections/timeline-duration": "Durée",
  "sections/timeline-education": "Enseignement",
  "sections/timeline-employee": "Emplois",
  "sections/timeline-europAssistance": "Europ Assistance",
  "sections/timeline-europAssistanceStory": "Pour <ea>Europ Assistance</ea>, j'ai créé un back-office côté client complet permettant à l'administrateur de gérer les permissions des utilisateurs.",
  "sections/timeline-freelance": "Freelance",
  "sections/timeline-monthDuration": "{duration} mois",
  "sections/timeline-monthsDuration": "{duration} mois",
  "sections/timeline-oecd": "OCDE",
  "sections/timeline-oecdStory": "<oecd>L'Organisation de coopération et de développement économiques (OCDE)</oecd> est une organisation internationale d'études économiques. Par le biais d'une application visant à aider les auteurs de l'OCDE à publier leurs ouvrages, ma mission m'a amené à réaliser :<ul><li>Une implementation de tests unitaires comprenant une couverture à hauteur de 70%.</li><li>La refonte d'un immense formulaire de publications de documents générant un gain significatif de performance et une meilleure modulabilité du code source.</li><li>L'implémentation de nouvelles fonctionnalités, notamment celle de préremplir le formulaire (fichiers, métadonnées) en fonction du profil de l'auteur et du type de la publication.</li></ul>",
  "sections/timeline-redpelicans": "Redpelicans",
  "sections/timeline-redpelicansStory": "<redpelicans>Redpelicans</redpelicans> est une société basée à Paris qui offre une expertise full stack Javascript à ses clients. Les 3 premiers mois de mon expérience en tant qu'employé ont été une période de formation intensive au full stack Javascript. Suivi de mon intégration progressive au sein de projets Javascript sophistiqués, me permettant d'avoir l'opportunité de travailler avec des développeurs qui ont plus de 20 ans d'expérience dans le domaine.",
  "sections/timeline-school": "École 42",
  "sections/timeline-schoolStory": "<school>42</school> est <bestSchool>l'une des meilleures écoles de développement</bestSchool> informatique. Cette dernière offre une pédagogie portée sur la rigueur, à la pointe de l'industrie. Le programme est conçu pour préparer les étudiants au monde numérique et à l'industrie technologique. Autour de <schoolProjects>projets intéressants</schoolProjects>, 42 m'a permis de perfectionner mes compétences en développement <lowLevel>bas niveau</lowLevel> et d'apprendre à travailler en équipe.",
  "sections/timeline-selfEducation": "Préliminaires",
  "sections/timeline-selfEducationStory": "Mon parcours a commencé en 2010 lorsque j'ai découvert la programmation. J'ai fait mes premiers pas en apprenant de zéro mes premiers langages de programmation (C, C++, Python). Très vite, j'ai adoré le fait de pouvoir créer des logiciels utiles et d'automatiser des tâches pénibles avec de simples lignes de code. Le WEB commence à m'intéresser tout particulièrement. Pendant cette période, j'ai mis au point quelques projets tels que des bots, des web scrapers et des applications web.",
  "sections/timeline-sisCc": "SIS-CC",
  "sections/timeline-sisCcStory": "Le projet consistait à mettre en œuvre un service d'authentification dans l'architecture <sis>SIS-CC</sis>, cette mission comprenait :<ul><li>L'étude préalable de l'outil Keycloak, et la livraison d'un modèle de la solution.</li><li>L'implémentation du workflow d'autorisation et des composants React permettant de gérer les routes privées.</li><li>La mise à niveau des serveurs de l'architecture pour gérer l'authentification.</li><li>La mise en place d'exemples de services back-end privés pour les développeurs tiers.</li></ul>",
  "sections/timeline-techs": "Technologies utilisées",
  "sections/timeline-unicef": "UNICEF",
  "sections/timeline-unicef2": "UNICEF 2",
  "sections/timeline-unicef2Story": "Dans cette mission, j'ai implémenté de nouvelles fonctionnalités sur l'interface de <childMortality>Childmortality</childMortality> telles que l'ajout de nouvelles séries de graphiques ou l'implémentation d'une responsive orientée mobile sur certaines vues.",
  "sections/timeline-unicefStory": "<p>Pour ma première mission avec <unicef>l'UNICEF</unicef>, j'ai dû réaliser un serveur de rendu sous la forme d'un service WEB permettant de transformer des parties de sections WEB HTML en PDF ou PNG.</p><p>Ce qui inclut le développement d'un serveur node.js hébergeant le service de rendu de sections via Puppeteer et la mise en place d'un 'show room' permettant au client de démontrer l'utilisation du service aux chefs de projets de l'UNICEF.</p>",
  "sections/timeline-yearDuration": "{duration} année",
  "sections/timeline-yearsDuration": "{duration} années"
}